package days01;
// 주석처리 : 실행은 되지 않고 실행 코드와 같이 위치하면서 프로그램 또는 코드에 대해 안내 설명합니다
// 한줄 주석 : '//'를 표시하고 사용합니다.
// 여러줄 주석 : /* ~ */ ~ 표시 부분에 내용을 적어 넣습니다.
/*
 여러줄 한번에
 주석 처리
*/
// 자바 프로그램의 단위는 class단위 입니다.
// 파일이름과 클래스(기본 public 클래스) 이름은 반드시 같아야 합니다.
public class First_java { // 클래스의 시작
	// 클래스 이름의 첫글자 대문자 필수. 두 단어가 조합된 이름이라면 두번째 단어도 첫글자 대문자를 사용합니다.
	// 자바 프로그램의 모든 내용은 클래스 내부에 씁니다.
	public static void main(String[] args) { // 프로그램의 시작
		// main 이라는 이름의 단위 요소가 프로그램의 시작과 끝을 지정합니다.
		System.out.println("겁나 쉬운 JAVA~!!");
		// 괄호 안의 큰따옴표 안쪽의 문자들을 화면에 그대로 출력하는 명령어입니다.
		// 자바 프로그램은 하나의 명령 단위마다 ';'을 표시하여 문장(명령)의 끝을 표시합니다.
		System.out.println("겁나 쉬운 JAVA~!!");
		System.out.println("겁나 쉬운 JAVA~!!");
		
	} // 프로그램의 끝
	
} // 클래스의 끝